In [1]:
import pandas as pd

<b>Main data-types <br>
series = one dimensional <br>
dataframe = two dimensional <br><b>

In [2]:
#working with series
series = pd.Series(['abcd', 'efgh', 'ijklmnop']) # S is capital
series

0        abcd
1        efgh
2    ijklmnop
dtype: object

In [3]:
#working with dataframes
df = pd.DataFrame({"column1": series, "column2": series})
df

    column1   column2
0      abcd      abcd
1      efgh      efgh
2  ijklmnop  ijklmnop

In [5]:
# import data
df = pd.read_csv("car-sales.csv")
df

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [6]:
# exporting a data frame
df.to_csv("exported_car-sales.csv")

In [7]:
# let us import the above exported file
temp = pd.read_csv("exported_car-sales.csv")
temp

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [8]:
# see that Unnamed column? we do not need that. So here is the solution
# export data again
df.to_csv("exported_car-sales.csv",  index = False)

In [9]:
# Now, let us import the above exported file
temp = pd.read_csv("exported_car-sales.csv")
temp

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [10]:
# problem solved. YAAY!